<template>
        <b-card :header="caption">
            
        <b-table :hover="hover" :striped="striped" :bordered="bordered" :small="small" :fixed="fixed" responsive="sm" :items="items" :fields="fields" :current-page="currentPage" :per-page="perPage">
          <template slot="status" slot-scope="data">
            <b-badge :variant="getBadge(data.item.status)">{{data.item.status}}</b-badge>
          </template>
        </b-table>
        <nav>
          <b-pagination :total-rows="getRowCount(items)" :per-page="perPage" v-model="currentPage" prev-text="Prev" next-text="Next" hide-goto-end-buttons/>
        </nav>
      </b-card>
</template>

<script>
/**
   * Randomize array element order in-place.
   * Using Durstenfeld shuffle algorithm.
   */

export default {
  props: {
    caption: {
      type: String,
      default: "矿区历史"
    },
    hover: {
      type: Boolean,
      default: false
    },
    striped: {
      type: Boolean,
      default: false
    },
    bordered: {
      type: Boolean,
      default: false
    },
    small: {
      type: Boolean,
      default: false
    },
    fixed: {
      type: Boolean,
      default: false
    }
  },
  data: () => {
    return {
      btc: "BTC",
      items: [
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          持续时间: "Member",
          矿池指数加权Hash速率: "Active",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: 14.02560189,
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Staff",
          最高以达难度值: "Banned",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Admin",
          最高以达难度值: "Inactive",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Member",
          最高以达难度值: "Pending",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Staff",
          最高以达难度值: "Active",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Member",
          最高以达难度值: "Active",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Staff",
          最高以达难度值: "Banned",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Admin",
          最高以达难度值: "Inactive",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Member",
          最高以达难度值: "Pending",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Staff",
          最高以达难度值: "Active",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Member",
          最高以达难度值: "Active",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Staff",
          最高以达难度值: "Banned",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Admin",
          最高以达难度值: "Inactive",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Member",
          最高以达难度值: "Pending",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Staff",
          最高以达难度值: "Active",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Member",
          最高以达难度值: "Active",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Staff",
          最高以达难度值: "Banned",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Admin",
          最高以达难度值: "Inactive",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Member",
          最高以达难度值: "Pending",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Staff",
          最高以达难度值: "Active",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Member",
          最高以达难度值: "Active",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Staff",
          最高以达难度值: "Banned",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Admin",
          最高以达难度值: "Inactive",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Staff",
          最高以达难度值: "Active",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        },
        {
          ID: "2012/01/01",
          矿区被发现在: "1.967 Ph/s",
          矿池指数加权Hash速率: "Member",
          最高以达难度值: "Pending",
          难度: "11111.zip",
          矿池运气: "45.90 %",
          "矿区#": 504412,
          矿区价值: "14.02560189",
          剩余确认数: 99
        }
      ],
      fields: [
        { key: "ID" },
        { key: "矿区被发现在" },
        { key: "矿池指数加权Hash速率" },
        { key: "最高以达难度值" },
        { key: "难度" },
        {key:"矿池运气"},
        {key:"矿区#"},
        {key:"矿区价值"},
        {key:"剩余确认数"}
      ],
      currentPage: 1,
      perPage: 10,
      totalRows: 0
    };
  },
  methods: {
    getRowCount(items) {
      return items.length;
    }
  }
};
</script>
